[
    {
        "images" : "<img src='captures/task1_map.png' alt='Карта'> <img src='captures/task1_algo.png' alt='Алгоритм'>",
        "task" : "<h1>Джунгли Амазонки</h1> <p>Ты попал в долину реки Амазонки. И чтобы выбраться из нее, нужно добраться до самой реки. Она выведет тебя из долины. У тебя есть карта, но на ней не понятно, где ты.</p> <p>PyRobot помог тебе создать алгоритм, при помощи которого ты сможешь выйти к реке в любом случае. Но PyRobot не понимает, что нужно поставить вместо знака вопроса. Выбери верный оператор, чтобы алгоритм PyRobot работал.</p> <p class='note'><strong>Примечание.</strong> Стрелочки указывают на то, откуда вероятнее всего ты можешь идти. Алгоритм работает от них.</p>",
        "AND" : 0,
        "OR" : 1,
        "right" : "<h1>Джунгли Амазонки</h1> <p>Ура! <strong>Ты сделал верный выбор!</strong> Ты выбрался к реке! Это было просто, неправда ли?</p>",
        "wrong" : "<h1>Джунгли Амазонки</h1> <p>Ты выбрался к реке, но <strong>ты сделал неверный выбор</strong>, поэтому по дороге ты упал дважды в яму, и тебя чуть не укусила ядовитая змея. Будь аккуратнее в следующий раз с выбором.</p>"
    },
    {
        "images" : "<img src='captures/task2_map.png' alt='Карта1'> <img src='captures/task2_map2.png' alt='Карта2'> <img src='captures/task2_algo.png' alt='Алгоритм'>",
        "task" : "<h1>Добраться до поселения</h1> <p>На той стороне реки есть поселение Итакуатьяра. Там тебе могут найти проход дальше. Но чтобы туда попасть, нужно найти мост. На карте мост и поселение отмечены.</p> <p>Сейчас ты все еще не знаешь, куда точно идти, потому что ты можешь выйти на мост с 4 сторон! Но PyRobot снова помог тебе в составлении алгоритма. Тебе осталось понять, какой оператор здесь нужен.</p>",
        "AND" : 1,
        "OR" : 0,
        "right" : "<h1>Добраться до поселения</h1> <p>А вот и поселение... Странное у него название. Но <strong>ты сделал верный выбор</strong> и добрался быстро! Ты молодец!</p>",
        "wrong" : "<h1>Добраться до поселения</h1> <p>А вот и поселение... Странное у него название. Но так как <strong>ты сделал неверный выбор</strong>, ты упал в реку и тебе пришлось изрядно попотеть убегая от алигаторов Амазонки. Будь осторожнее с выбором.</p>"
    },
    {
        "images" : "<img src='captures/task3_map.png' alt='Карта'> <img src='captures/task3_algo.png' alt='Алгоритм'>",
        "task" : "<h1>Поселение Итакуатьяра</h1> <p>В поселении живут гордые амазонки, и они не соглашаются показывать дорогу дальше, пока ты не сыграешь с ними в игру Джуманджи. Нужно выиграть амазонок, чтобы они показали дорогу обратно из Повторяндии.</p> <p>Ты, конечно же, соглашаешься играть, иначе ты застрянешь в этой стране навсегда. Но Джуманджи не простая игра, и она засасывает тебя внутрь себя. Теперь ты внутри игры. Обратно пути нет.</p> <p>Твое первое задание в игре: по карте найти конюшню. Лошади знают всю местность, и при помощи них ты дойдешь до выхода из игры.</p> <p>Посмотри на карту и вставь пропущенный оператор в алгоритм от PyRobot.</p> <p class='note'><strong>Примечание.</strong> Стрелочки указывают место, откуда ты можешь начать свой путь.</p>",
        "AND" : 1,
        "OR" : 0,
        "right" : "<h1>Поселение Итакуатьяра</h1> <p>Молодец! <strong>Ты сделал верный выбор</strong> и быстро добрался до стойла лошадей!</p>",
        "wrong" : "<h1>Поселение Итакуатьяра</h1> <p>Упс... Кажется, <strong>ты сделал неверный выбор</strong>... Лошади теперь будут тебя бояться... Просто ты упал в огромное болото грязи... Удачи дальше... :)</p>"
    },
    {
        "images" : "",
        "task" : "<h1>Выбор лошади</h1> <p>Чтобы лошадь довезла тебя до выхода <strong>быстро и аккуратно</strong>, тебе нужно выбрать правильную лошадь. Лошадь с белой шерсткой ездит быстро, а лошадь с коричневой шерсткой ездит медленно. Лошадь с пятнами будет очень сильно брыкаться и вероятнее всего сбросит тебя. А лошадь без пятен будет ехать послушно и довезет тебя аккуратно до нужного места.</p> <p>В стойле стоит 16 лошадей. Тебе нужно выбрать верную, следуя всем этим параметрам. PyRobot составил алгоритм, который поможет выбрать верную лошадь. Заверши алгоритм, выбрав верный оператор.</p>",
        "AND" : 1,
        "OR" : 0,
        "right" : "<h1>Выбор лошади</h1> <p>Прекрасно! Лошадь <strong>ты выбрал правильно</strong>! Она довезла тебя до места быстро и аккуратно.</p>",
        "wrong" : "<h1>Выбор лошади</h1> <p><strong>Ты сделал неверный выбор</strong>, когда взял эту лошадь. Она тебя сбросила на 2 минуте езды. А я говорил тебе, что нужно выбирать лошадь тщательно. Теперь иди пешком...</p>"
    },
    {
        "images" : "<img src='captures/task5_map.png' alt='Карта'> <img src='captures/task5_algo.png' alt='Алгоритм'>",
        "task" : "<h1>Выбери верный путь</h1> <p>Теперь нужно выбрать верный путь, который сможет привести тебя к выходу из игры. Выход из игры находится в большом розовом амбаре.</p> <p>Выбери правильный оператор, чтобы алгоритм, который укажет лошади на верный путь, работал.</p> <p class='note'><strong>Примечание.</strong> Стрелочки указывают место, откуда ты можешь начать свой путь.</p>",
        "AND" : 0,
        "OR" : 1,
        "right" : "<h1>Выбери верный путь</h1> <p>Замечательно! <strong>Ты справился</strong> с заданием и теперь ты можешь выйти из игры!</p>",
        "wrong" : "<h1>Выбери верный путь</h1> <p>Ооох... <strong>Ты сделал совсем не тот выбор</strong>, который нужно было... Ты добрался до выхода из игры, но какой ценой... Удушающие лианы, алигаторы, грязевые ванны...</p>"
    },
    {
        "images" : "<img src='captures/task6_map.png' alt='Панель кнопок'> <img src='captures/task6_algo.png' alt='Алгоритм'>",
        "task" : "<h1>Выход из игры</h1> <p>Чтобы выйти из игры, нужно нажать на правильную кнопку на панели.</p> <p>Все кнопки образуют пароль, если их нажимать сверху вниз по одной на ряду. Кнопка должна переправить твои <strong>душу и тело</strong> обратно из игры в страну Повторяндию. Зеленая кнопка переправит твою душу, а красная твое тело. Квадратная кнопка также переправит твою душу, а вот круглая не сделает ничего.</p> <p>Выбери верный оператор, который поможет алгоритму, составленному PyRobot'ом, выбрать верную кнопку на панели.</p>",
        "AND" : 1,
        "OR" : 0,
        "right" : "<h1>Выход из игры</h1> <p>Супер! Ты выбрался из игры, сделав <strong>правильный выбор</strong>!</p>",
        "wrong" : "<h1>Выход из игры</h1> <p>Ну что ж... Надеюсь, твою душу кто-нибудь вытащит из игры. А пока <strong>ты сделал неверный выбор</strong>, и тебе придется ждать помощи...</p> <p><br>Спустя 2 часа...<br></p> <p>Спасибо PyRobot'у за то, что он помог тебе вытащить твою душу тоже. В следуюий раз будь аккуратнее с выбором.</p>"
    },
    {
        "images" : "<img src='task7.png' alt='Алгоритм'> ",
        "task" : "<h1>Переправа через океан</h1> <p>Ты справился с заданием амазонок. Теперь они помогут тебе отыскать место для переправы через океан. Для этого нужно пересечь реку в другом месте, которое можно найти, свернув <strong>дважды у папоротника налево и дважды у банановой пальмы налево</strong>, в других случаях поворачивать нужно направо.</p> <p>PyRobot снова подготовил для тебя алгоритм, осталось только вставить туда верный оператор. Выбирай, и двигаемся дальше!</p>",
        "AND" : 0,
        "OR" : 1,
        "right" : "<h1>Переправа через океан</h1> <p>Прекрасная работа! Ты добрался до места переправы без каких-либо проблем, потому что сделал <strong>верный выбор!</strong></p>",
        "wrong" : "<h1>Переправа через океан</h1> <p>Ты слегка запутался в джунглях, потому что сделал <strong>неверный выбор</strong>. Но главное, что у тебя есть помощник PyRobot, который все-таки вывел тебя на нужное место.</p>"
    },
    {
        "images" : "<img src='captures/task8.png' alt='Алгоритм'>",
        "task" : "<h1>Водные горки</h1> <p>Чтобы переправится через океан, тебе нужно будет прокатиться на водных горках - это большая сеть подводных труб, по которым течет вода и можно переправится через океан весело и безопасно. Чтобы переправится без проблем, тебе нужно следовать правилам: видишь синюю трубу - поворачивай вправо, видишь решетку слева - поворачивай вправо, в остальных случаях - поворачивай влево.</p> <p>PyRobot подготовил алгоритм, который проведет тебя по трубам. Но нужно добавить верный оператор на место знака вопроса. Выбирай кнопку и нажимай быстрее!</p>",
        "AND" : 0,
        "OR" : 1,
        "right" : "<h1>Водные горки</h1> <p>Поздравляю! <strong>Ты сделал верный выбор!</strong> Ты на месте!</p>",
        "wrong" : "<h1>Водные горки</h1> <p>Поздравляю! <strong>Ты сделал НЕверный выбор!</strong> Поэтому ты дважды врезался в решетку и трижды свернул не туда... Но ты все-таки на месте!</p>"
    }
]